{
  "backend/main.mo": "Empty actor canister with no methods defined.",
  "feature_evidence.json": "Feature evidence file documenting deployment of Draft Version 6 and related components.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries for various frontend files and assets.",
  "frontend/index.css": "Tailwind CSS base with extensive OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "HTML entry point loading fonts, metadata, and mounting the React app.",
  "frontend/public/draft-version.txt": "Text marker indicating Draft Version 6.",
  "frontend/src/App.tsx": "Main React app rendering header, hero, category grid, order form, and contact sections with smooth scrolling.",
  "frontend/src/components/CategoryGrid.tsx": "Displays a grid of five crochet item categories using static image assets.",
  "frontend/src/components/ContactSection.tsx": "Renders contact card with email and Instagram links and action buttons.",
  "frontend/src/components/OrderNowForm.tsx": "Full order form handling validation, email generation, mailto, and clipboard fallback.",
  "frontend/src/components/WhyChooseSection.tsx": "Shows four value‑proposition cards with icons and descriptions.",
  "frontend/src/hooks/useActor.ts": "React hook creating and updating a backend actor based on Internet Identity authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, logging in, clearing identity, and tracking login status.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder hook file indicating backend queries are not used and all actions occur client‑side.",
  "frontend/src/index.css": "Tailwind base stylesheet defining color variables, dark mode theming, typography, and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the Internet Identity provider.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, typography, animations, and extended theme settings.",
  "project_state.json": "Metadata describing project state, features, issues, and build instructions for the CraftyMini site."
}